/*
	思路：用数组下标代表分数，下标对应元素值代表该分数的人数
	*/


#include <stdio.h>

int main()
{
	int a[11],i,j,t;
	for (i=0; i<=10; i++)
		{
			a[i] = 0;       //初始化为0        
			//int a[11] = {0}
		}
		
	for (i=1; i<=5 ;i++)    //循环读入5个数
		{
			scanf("%d",&t);		//把每一个数存入变量t中《分数对应位置》		
									//scanf("%d",&a[i])  依次对数组中每个数赋值
			a[t]++;			//进行计数《记录分数出现了几次》
		}
		
	
	for (i=0; i<=10; i++)      //从小到大输出（从大到小  for (i=10;i>=0;i--))    依次判断a[0]-a[10]
		for (j=0; j<=a[i]; j++)		//出现几次就打印几次
			{
				printf("%d ",i);
			}
			
			
	system("pause")			//暂停
	return 0;
}
		
